### Week 1 - Lire et manipuler un fichier Excel

#### Objectifs
- Lire un fichier Excel existant avec `pandas`
- Explorer et comprendre les données
- Effectuer des opérations simples (filtrer, trier, créer des colonnes)
- Sauvegarder les données modifiées dans un nouveau fichier Excel

#### Lire un fichier Excel

In [3]:
import pandas as pd
# Lire un fichier Excel existant
df = pd.read_excel("Week 0.xlsx", engine="openpyxl")
# Afficher les 5 premières lignes
df.head()

       Nom  Age  Salaire_net
0    Alice   23        35000
1  Charlie   37        60000

#### Filtrer les données

In [4]:
# Filtrer les employés dont le salaire est supérieur à 40 000
df_filtré = df[df["Salaire_net"] > 40000]
df_filtré

       Nom  Age  Salaire_net
1  Charlie   37        60000

#### Trier les données

In [5]:
# Trier par âge décroissant
df_tri = df.sort_values(by="Age", ascending=False)
df_tri

       Nom  Age  Salaire_net
1  Charlie   37        60000
0    Alice   23        35000

#### Créer ou insérer une nouvelle colonne

In [6]:
# Ajouter une colonne Salaire brut (ex : 25% de charges)
df["Salaire_brut"] = df["Salaire_net"] * 1.25
df

       Nom  Age  Salaire_net  Salaire_brut
0    Alice   23        35000       43750.0
1  Charlie   37        60000       75000.0

#### Enregistrer le fichier modifié

In [ ]:
# Sauvegarder dans un nouveau fichier Excel
df.to_excel("Week 1 V1.xlsx", index=False, engine="openpyxl")

In [ ]:
# Insérer deux colonnes : % de charge et Salaire brut
from openpyxl import load_workbook
from openpyxl.styles import numbers

# Charger le fichier Excel
wb = load_workbook("Week 0.xlsx")
ws = wb.active

# Ajouter les en-têtes
ws["D1"] = "Charge (%)"
ws["E1"] = "Salaire_brut"

# Remplir les colonnes
for row in range(2, ws.max_row + 1):
    # Mettre 25 % dans la colonne D
    ws[f"D{row}"] = 0.25
    ws[f"D{row}"].number_format = '0.00%'

    # Formule dans la colonne E : =C2*(1+D2)
    ws[f"E{row}"] = f"=C{row}*(1+D{row})"
    ws[f"E{row}"].number_format = numbers.FORMAT_CURRENCY_EUR_SIMPLE

wb.save("Week 1 V - avec salaire brut.xlsx")